Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4C.xml
        <module name="PEVC" id="I7533" version="2.0.0">
          <instance name="PEVC">
            <register-group name="PEVC" name-in-module="PEVC" address-space="base" offset="0x400A6000"/>
            <signals>
              <signal group="PAD_EVT" index="0" function="C" pad="PA08"/>
              <signal group="PAD_EVT" index="0" function="C" pad="PB12"/>
              <signal group="PAD_EVT" index="0" function="C" pad="PC07"/>
              <signal group="PAD_EVT" index="0" function="C" pad="PC24"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PA09"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PB13"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PC08"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PC25"/>
              <signal group="PAD_EVT" index="2" function="C" pad="PA10"/>
              <signal group="PAD_EVT" index="2" function="C" pad="PC11"/>
              <signal group="PAD_EVT" index="2" function="C" pad="PC26"/>
              <signal group="PAD_EVT" index="2" function="B" pad="PB09"/>
              <signal group="PAD_EVT" index="3" function="C" pad="PA11"/>
              <signal group="PAD_EVT" index="3" function="C" pad="PC27"/>
              <signal group="PAD_EVT" index="3" function="B" pad="PB10"/>
            </signals>
            <parameters>
              <param name="EVIN_BITS" value="31"/>
              <param name="PADS_BITS" value="4"/>
              <param name="TRIGOUT_BITS" value="19"/>
            </parameters>
          </instance>
        </module>
        <module name="PICOUART" id="I8403" version="1.0.1">
          <instance name="PICOUART">
            <register-group name="PICOUART" name-in-module="PICOUART" address-space="base" offset="0x400F1400"/>
          </instance>
        </module>
        <module name="PM" id="I7146" version="4.4.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x400E0000"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="AWEN_LCDCA" value="7"/>
              <param name="AWEN_PICOUART" value="6"/>
              <param name="AWEN_TWIS0" value="0"/>
              <param name="AWEN_TWIS1" value="1"/>
              <param name="AWEN_USBC" value="2"/>
              <param name="MCCTRL_MCSEL_DFLL0" value="3"/>
              <param name="MCCTRL_MCSEL_FLO" value="7"/>
              <param name="MCCTRL_MCSEL_OSC0" value="1"/>
              <param name="MCCTRL_MCSEL_PLL0" value="2"/>
              <param name="MCCTRL_MCSEL_RCFAST" value="5"/>
              <param name="MCCTRL_MCSEL_RC1M" value="6"/>
              <param name="MCCTRL_MCSEL_RC80M" value="4"/>
              <param name="MCCTRL_MCSEL_SLOW" value="0"/>
              <param name="PM_CLK_APB_NUM" value="4"/>
              <param name="PPCR_FLASH_WAIT_BGREF_MASK" value="512"/>
              <param name="PPCR_FLASH_WAIT_BOD18_MASK" value="1024"/>
              <param name="PM_SMODE_DEEPSTOP" value="4"/>
              <param name="PM_SMODE_FROZEN" value="1"/>
              <param name="PM_SMODE_IDLE" value="0"/>
              <param name="PM_SMODE_SHUTDOWN" value="6"/>
              <param name="PM_SMODE_STANDBY" value="2"/>
              <param name="PM_SMODE_STATIC" value="5"/>
              <param name="PM_SMODE_STOP" value="3"/>
            </parameters>
            <clock-groups>
              <clock-group name="CPU" grouporder="0">
                <clock name="OCD" bit="0"/>
              </clock-group>
              <clock-group name="HSB" grouporder="1">
                <clock name="PDCA" bit="0"/>
                <clock name="HFLASHC" bit="1"/>
                <clock name="HRAMC1" bit="2"/>
                <clock name="USBC" bit="3"/>
                <clock name="CRCCU" bit="4"/>
                <clock name="HTOP0" bit="5"/>
                <clock name="HTOP1" bit="6"/>
                <clock name="HTOP2" bit="7"/>
                <clock name="HTOP3" bit="8"/>
                <clock name="AESA" bit="9"/>
              </clock-group>
              <clock-group name="PBA" grouporder="2">
                <clock name="IISC" bit="0"/>
                <clock name="SPI" bit="1"/>
                <clock name="TC0" bit="2"/>
                <clock name="TC1" bit="3"/>
                <clock name="TWIM0" bit="4"/>
                <clock name="TWIS0" bit="5"/>
                <clock name="TWIM1" bit="6"/>
                <clock name="TWIS1" bit="7"/>
                <clock name="USART0" bit="8"/>
                <clock name="USART1" bit="9"/>
                <clock name="USART2" bit="10"/>
                <clock name="USART3" bit="11"/>
                <clock name="ADCIFE" bit="12"/>
                <clock name="DACC" bit="13"/>
                <clock name="ACIFC" bit="14"/>
                <clock name="GLOC" bit="15"/>
                <clock name="ABDACB" bit="16"/>
                <clock name="TRNG" bit="17"/>
                <clock name="PARC" bit="18"/>
                <clock name="CATB" bit="19"/>
                <clock name="TWIM2" bit="21"/>
                <clock name="TWIM3" bit="22"/>
                <clock name="LCDCA" bit="23"/>
              </clock-group>
              <clock-group name="PBB" grouporder="3">
                <clock name="HFLASHC" bit="0"/>
                <clock name="HCACHE" bit="1"/>
                <clock name="HMATRIX" bit="2"/>
                <clock name="PDCA" bit="3"/>
                <clock name="CRCCU" bit="4"/>
                <clock name="USBC" bit="5"/>
                <clock name="PEVC" bit="6"/>
              </clock-group>
              <clock-group name="PBC" grouporder="4">
                <clock name="PM" bit="0"/>
                <clock name="CHIPID" bit="1"/>
                <clock name="SCIF" bit="2"/>
                <clock name="FREQM" bit="3"/>
                <clock name="GPIO" bit="4"/>
              </clock-group>
              <clock-group name="PBD" grouporder="5">
                <clock name="BPM" bit="0"/>
                <clock name="BSCIF" bit="1"/>
                <clock name="AST" bit="2"/>
                <clock name="WDT" bit="3"/>
                <clock name="EIC" bit="4"/>
                <clock name="PICOUART" bit="5"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
