Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LC4C.xml
        <register name="UESTA3CLR" offset="0x16c" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
        <register name="UESTA4CLR" offset="0x170" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
        <register name="UESTA5CLR" offset="0x174" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
        <register name="UESTA6CLR" offset="0x178" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
        <register name="UESTA7CLR" offset="0x17c" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Clear Register">
          <bitfield name="TXINIC" caption="TXINI Clear" mask="0x1"/>
          <bitfield name="RXOUTIC" caption="RXOUTI Clear" mask="0x2"/>
          <bitfield name="RXSTPIC" caption="RXSTPI Clear" mask="0x4"/>
          <bitfield name="NAKOUTIC" caption="NAKOUTI Clear" mask="0x8"/>
          <bitfield name="NAKINIC" caption="NAKINI Clear" mask="0x10"/>
          <bitfield name="STALLEDIC" caption="STALLEDI Clear" mask="0x40"/>
          <bitfield name="RAMACERIC" caption="RAMACERI Clear" mask="0x800"/>
        </register>
        <register name="UESTA0SET" offset="0x190" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UESTA1SET" offset="0x194" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UESTA2SET" offset="0x198" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UESTA3SET" offset="0x19c" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UESTA4SET" offset="0x1a0" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UESTA5SET" offset="0x1a4" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UESTA6SET" offset="0x1a8" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UESTA7SET" offset="0x1ac" rw="W" size="4" initval="0x00000000" caption="Endpoint Status Set Register">
          <bitfield name="TXINIS" caption="TXINI Set" mask="0x1"/>
          <bitfield name="RXOUTIS" caption="RXOUTI Set" mask="0x2"/>
          <bitfield name="RXSTPIS" caption="RXSTPI Set" mask="0x4"/>
          <bitfield name="NAKOUTIS" caption="NAKOUTI Set" mask="0x8"/>
          <bitfield name="NAKINIS" caption="NAKINI Set" mask="0x10"/>
          <bitfield name="STALLEDIS" caption="STALLEDI Set" mask="0x40"/>
          <bitfield name="RAMACERIS" caption="RAMACERI Set" mask="0x800"/>
          <bitfield name="NBUSYBKS" caption="NBUSYBK Set" mask="0x1000"/>
        </register>
        <register name="UECON0" offset="0x1c0" rw="R" size="4" initval="0x00000000" caption="Endpoint Control Register">
          <bitfield name="TXINE" caption="TXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="RXOUTE" caption="RXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="RXSTPE" caption="RXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="NAKOUTE" caption="NAKOUT Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKINE" caption="NAKIN Interrupt Enable" mask="0x10"/>
          <bitfield name="STALLEDE" caption="STALLED Interrupt Enable" mask="0x40"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x100"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x800"/>
          <bitfield name="NBUSYBKE" caption="Number of Busy Banks Interrupt Enable" mask="0x1000"/>
          <bitfield name="KILLBK" caption="Kill IN Bank" mask="0x2000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="NYETDIS" caption="NYET token disable" mask="0x20000"/>
          <bitfield name="RSTDT" caption="Reset Data Toggle" mask="0x40000"/>
          <bitfield name="STALLRQ" caption="STALL Request" mask="0x80000"/>
          <bitfield name="BUSY0" caption="Busy Bank1 Enable" mask="0x1000000"/>
          <bitfield name="BUSY1" caption="Busy Bank0 Enable" mask="0x2000000"/>
        </register>
        <register name="UECON1" offset="0x1c4" rw="R" size="4" initval="0x00000000" caption="Endpoint Control Register">
          <bitfield name="TXINE" caption="TXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="RXOUTE" caption="RXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="RXSTPE" caption="RXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="NAKOUTE" caption="NAKOUT Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKINE" caption="NAKIN Interrupt Enable" mask="0x10"/>
          <bitfield name="STALLEDE" caption="STALLED Interrupt Enable" mask="0x40"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x100"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x800"/>
          <bitfield name="NBUSYBKE" caption="Number of Busy Banks Interrupt Enable" mask="0x1000"/>
          <bitfield name="KILLBK" caption="Kill IN Bank" mask="0x2000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="NYETDIS" caption="NYET Token Enable" mask="0x20000"/>
          <bitfield name="RSTDT" caption="Reset Data Toggle" mask="0x40000"/>
          <bitfield name="STALLRQ" caption="STALL Request" mask="0x80000"/>
          <bitfield name="BUSY0" caption="Busy Bank1 Enable" mask="0x1000000"/>
          <bitfield name="BUSY1" caption="Busy Bank0 Enable" mask="0x2000000"/>
        </register>
        <register name="UECON2" offset="0x1c8" rw="R" size="4" initval="0x00000000" caption="Endpoint Control Register">
          <bitfield name="TXINE" caption="TXIN Interrupt Enable" mask="0x1"/>
          <bitfield name="RXOUTE" caption="RXOUT Interrupt Enable" mask="0x2"/>
          <bitfield name="RXSTPE" caption="RXSTP Interrupt Enable" mask="0x4"/>
          <bitfield name="NAKOUTE" caption="NAKOUT Interrupt Enable" mask="0x8"/>
          <bitfield name="NAKINE" caption="NAKIN Interrupt Enable" mask="0x10"/>
          <bitfield name="STALLEDE" caption="STALLED Interrupt Enable" mask="0x40"/>
          <bitfield name="NREPLY" caption="No Reply" mask="0x100"/>
          <bitfield name="RAMACERE" caption="RAMACER Interrupt Enable" mask="0x800"/>
          <bitfield name="NBUSYBKE" caption="Number of Busy Banks Interrupt Enable" mask="0x1000"/>
          <bitfield name="KILLBK" caption="Kill IN Bank" mask="0x2000"/>
          <bitfield name="FIFOCON" caption="FIFO Control" mask="0x4000"/>
          <bitfield name="NYETDIS" caption="NYET Token Enable" mask="0x20000"/>
          <bitfield name="RSTDT" caption="Reset Data Toggle" mask="0x40000"/>
          <bitfield name="STALLRQ" caption="STALL Request" mask="0x80000"/>
          <bitfield name="BUSY0" caption="Busy Bank1 Enable" mask="0x1000000"/>
          <bitfield name="BUSY1" caption="Busy Bank0 Enable" mask="0x2000000"/>
        </register>
